OpenFOAM-v1812/tutorials/combustion/fireFoam/LES/simplePMMApanel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication topoSet
runApplication extrudeToRegionMesh -overwrite
runApplication $(getApplication)

paraFoam -touchAll

#------------------------------------------------------------------------------
